Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: The `value` group
ja_jp: `value` グループ

source: The `value` group is used to manipulate https://redis.io/docs/manual/data-types/#strings[Redis Strings]. Thus, this group is not limited to Java Strings but can be used for integers (like a counter) or binary content (like images).
ja_jp: `value` グループは https://redis.io/docs/manual/data-types/#strings[Redis 文字列] を操作するために使用されます。したがって、このグループは Java の文字列に限定されることなく、整数 (カウンターなど) やバイナリーコンテンツ (イメージなど) にも使用することができます。

source: The `weather-stations` table is read into a `GlobalKTable`, representing the current state of each weather station
ja_jp: `weather-stations` テーブルは `GlobalKTable` に読み込まれ、各気象観測所の現在の状態を表す

source: The `web-app` application type is used when the `quarkus-oidc` extension uses an <<authorization-code-flow> to authenticate users to Quarkus and create session cookies.
ja_jp: `web-app` アプリケーションタイプは、 `quarkus-oidc` エクステンションが <<authorization-code-flow>> を使用してユーザーを Quarkus に対して認証し、セッションクッキーを作成する場合に使用されます。

source: The `webAuthn.loginClientSteps` method invokes the login challenge endpoint, then calls the authenticator and returns a https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Promise[Promise object] containing a JSON object suitable for being sent to the login endpoint. You can use that JSON object in order to store the credentials in hidden form `input` elements, for example, and send it as part of a regular HTML form:
ja_jp: `webAuthn.loginClientSteps` メソッドはログインチャレンジのエンドポイントを呼び出し、次にオーセンティケーターを呼び出して、 ログインエンドポイントへの送信に適した JSON オブジェクトを 含む https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Promise[Promise オブジェクト] を返します。この JSON オブジェクトを使用して、たとえば、認証情報を非表示フォームの `input` に保存し、 通常の HTML フォームの一部として送信できます。

source: The `webAuthn.loginOnly` method invokes the login challenge endpoint, then calls the authenticator and returns a https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Promise[Promise object] containing a JSON object suitable for being sent to the callback endpoint. You can use that JSON object in order to store the credentials in hidden form `input` elements, for example, and send it as part of a regular HTML form:
ja_jp: `webAuthn.loginOnly` メソッドはログインチャレンジのエンドポイントを呼び出し、次にオーセンティケータを呼び出して、コールバックエンドポイントに送信するのに適した JSON オブジェクトを含む link:https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Promise[Promise オブジェクト] を返します。その JSON オブジェクトを使用して、たとえば隠しフォーム `input` 要素にクレデンシャルを格納したり、通常の HTML フォームの一部として送信したりすることができます。

source: The `webAuthn.login` method invokes the login challenge endpoint, then calls the authenticator and invokes the callback endpoint for that login, and returns a https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Promise[Promise object]:
ja_jp: `webAuthn.login` メソッドは、ログインチャレンジのエンドポイントを呼び出し、次に認証デバイスを呼び出してそのログインのコールバックエンドポイントを呼び出し、 link:https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Promise[Promiseオブジェクト] を返します。

source: The `webAuthn.login` method invokes the login challenge endpoint, then calls the authenticator and invokes the login endpoint for that login, and returns a https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Promise[Promise object]:
ja_jp: `webAuthn.login` メソッドは、ログインチャレンジエンドポイントを呼び出し、次にオーセンティケーターを呼び出してそのログインのためのログインエンドポイントを呼び出し、 https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Promise[Promise オブジェクト] を返します。

source: The `webAuthn.registerClientSteps` method invokes the registration challenge endpoint, then calls the authenticator and returns a https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Promise[Promise object] containing a JSON object suitable for being sent to the registration endpoint. You can use that JSON object in order to store the credentials in hidden form `input` elements, for example, and send it as part of a regular HTML form:
ja_jp: `webAuthn.registerClientSteps` メソッドは、登録チャレンジエンドポイントを呼び出し、次にオーセンティケーターを呼び出して、 登録エンドポイントへの送信に適した JSON オブジェクトを含む https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Promise[Promise オブジェクト] を返します。この JSON オブジェクトを使用して、たとえば、認証情報を非表示フォームの `input` に保存し、 通常の HTML フォームの一部として送信できます。

source: The `webAuthn.registerOnly` method invokes the registration challenge endpoint, then calls the authenticator and returns a https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Promise[Promise object] containing a JSON object suitable for being sent to the callback endpoint. You can use that JSON object in order to store the credentials in hidden form `input` elements, for example, and send it as part of a regular HTML form:
ja_jp: `webAuthn.registerOnly` メソッドは登録チャレンジのエンドポイントを呼び出し、次に認証ツールを呼び出して、コールバックエンドポイントに送信するのに適した JSON オブジェクトを含む link:https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Promise[Promise オブジェクト] を返します。その JSON オブジェクトを使用して、たとえば隠しフォーム `input` 要素にクレデンシャルを格納し、通常の HTML フォームの一部として送信することができます。

source: The `webAuthn.register` method invokes the registration challenge endpoint, then calls the authenticator and invokes the callback endpoint for that registration, and returns a https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Promise[Promise object]:
ja_jp: `webAuthn.register` メソッドは、登録チャレンジエンドポイントを呼び出し、次に認証デバイスを呼び出してその登録のためのコールバックエンドポイントを呼び出し、 link:https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Promise[Promise オブジェクト] を返します。

source: The `webAuthn.register` method invokes the registration challenge endpoint, then calls the authenticator and invokes the registration endpoint for that registration, and returns a https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Promise[Promise object]:
ja_jp: `webAuthn.register` メソッドは、登録チャレンジエンドポイントを呼び出し、次にオーセンティケーターを呼び出してその登録のための登録エンドポイントを呼び出し、 https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Promise[Promise オブジェクト] を返します。

source: The `xray` propagator will need the https://github.com/open-telemetry/opentelemetry-java-contrib/tree/main/aws-xray-propagator[aws] extension to be added as a dependency to your project.
ja_jp: `xray` プロパゲーターは、お客様のプロジェクトに link:https://github.com/open-telemetry/opentelemetry-java-contrib/tree/main/aws-xray-propagator[aws] エクステンションを依存関係として追加することを必要とします。

source: The `xray` propagator will need the https://github.com/open-telemetry/opentelemetry-java/tree/main/extensions/aws[aws] extension to be added as a dependency to your project.
ja_jp: `xray` プロパゲータは、 link:https://github.com/open-telemetry/opentelemetry-java/tree/main/extensions/aws[aws]エクステンションをプロジェクトに依存関係として追加する必要があります。

source: The `{#if}` section represents a basic control flow section. The simplest possible version accepts a single parameter and renders the content if the condition is evaluated to `true`. A condition without an operator evaluates to `true` if the value is not considered `falsy`, i.e. if the value is not `null`, `false`, an empty collection, an empty map, an empty array, an empty string/char sequence or a number equal to zero.
ja_jp: `{#if}` セクションは、基本的な制御フローセクションを表しています。 最も単純なバージョンでは、単一のパラメーターを受け取り、条件が `true` と評価された場合にコンテンツをレンダリングします。 演算子なしの条件は値が `falsy` (つまり、 `null` 、 `false` 、空のコレクション、空のマップ、空の配列、空の文字列/文字列シーケンス、またはゼロに等しい数) ではない場合、 `true` と評価されます。

source: The `{#if}` section represents a basic control flow section. The simplest possible version accepts a single parameter and renders the content if the condition is evaluated to `true`. A condition without an operator evaluates to `true` if the value is not considered `falsy`, i.e. if the value is not `null`, `false`, an empty collection, an empty map, an empty array, an empty string/char sequence, an empty `java.util.Optional`/`java.util.OptionalInt`/`java.util.OptionalLong`/`java.util.OptionalDouble` or a number equal to zero.
ja_jp: `{#if}` セクションは、基本的な制御フローセクションを表します。最も単純なバージョンでは、単一のパラメーターを受け取り、条件が `true` と評価された場合にコンテンツをレンダリングします。演算子なしの条件は、値が `falsy` (つまり、`null`、`false`、空のコレクション、空のマップ、空の配列、空の文字列/文字シーケンス、空の `java.util.Optional`/`java.util.OptionalInt`/`java.util.OptionalLong`/`java.util.OptionalDouble`、またはゼロに等しい数) ではない場合、`true` と評価されます。

source: The `{#include index-entry /}` will use a template located in the Quarkus project codestart which displays standard info from the `codestart.yml` metadata.
ja_jp: `{#include index-entry /}` は、Quarkus プロジェクトの Codestart にある、 `codestart.yml` メタデータから標準的な情報を表示するテンプレートを使用することになります。

source: The `{#include readme-header /}` will use a template located in the Quarkus project codestart which displays standard info from the `codestart.yml` metadata.
ja_jp: `{#include readme-header /}` は、Quarkus プロジェクトの Codestart にある、 `codestart.yml` メタデータから標準的な情報を表示するテンプレートを使用することになります。

source: The `{#insert}` and `{#include}` sections can be used to specify the extended template to include in the current template. This release extends the support for these sections with validation, document link, completion, and code lens.
ja_jp: `{#insert}` 、 `{#include}` セクションを使用して、現在のテンプレートに含める拡張テンプレートを指定することができます。このリリースでは、バリデーション、ドキュメントリンク、補完、コードレンズでこれらのセクションのサポートを拡張しています。

source: The `{devRootAppend}` variable can also be used in templates to construct URLs for static dev console resources, for example:
ja_jp: `{devRootAppend}` 変数は、テンプレートでも使用することができ、例えば、静的なdev consoleリソースのURLを構築することができます:

source: The `{frg:username}` expression outputs the fragment content. `frg:` can be replaced with `fragment:`.
ja_jp: `{frg:username}` 式は、フラグメントの内容を出力します。 `frg:` は、 `fragment:` に置き換えることができます。

source: The `{item.name}` expression implies that the `Templates#items$item()` method must declare a parameter of name `item` and type `org.acme.Item`.
ja_jp: `{item.name} `式では、`Templates#items$item()` メソッドが、名前 `item` および型 `org.acme.Item` のパラメーターを宣言する必要があります。

source: The `{keycloak-image}` image which contains a Keycloak distribution powered by Quarkus is used to start a container by default. `quarkus.keycloak.devservices.image-name` can be used to change the Keycloak image name. For example, set it to `quay.io/keycloak/keycloak:19.0.3-legacy` to use a Keycloak distribution powered by WildFly. Be aware that a Quarkus-based Keycloak distribution is only available starting from Keycloak `20.0.0`.
ja_jp: デフォルトでは、Quarkus を搭載した Keycloak ディストリビューションを含む `{keycloak-image}` イメージがコンテナーの起動に使用されます。`quarkus.keycloak.devservices.image-name` を使用して、Keycloak イメージ名を変更できます。たとえば、WildFly を搭載した Keycloak ディストリビューションを使用するには、`quay.io/keycloak/keycloak:19.0.3-legacy` に設定します。Quarkus ベースの Keycloak ディストリビューションは、Keycloak `20.0.0` 以降でのみ使用できることに注意してください。

source: The ability to inject a https://docs.jboss.org/hibernate/orm/6.2/userguide/html_single/Hibernate_User_Guide.html#_statelesssession[`StatelessSession`] by using CDI (Contexts and Dependency Injection).
ja_jp: CDI（Contexts and Dependency Injection）を使用して https://docs.jboss.org/hibernate/orm/6.2/userguide/html_single/Hibernate_User_Guide.html#_statelesssession[`StatelessSession`] を注入する機能。

source: The above URL uses the value `1` and `2` to identity the target member of the list, but any unique string can be used.
ja_jp: 上記のURLでは、リストの対象メンバーを識別するために `1` と `2` という値を使用していますが、任意の一意の文字列を使用することができます。

source: The above `maven-compiler-plugin` configuration requires version 3.5+.
ja_jp: 上記の `maven-compiler-plugin` の設定には、バージョン 3.5+ が必要です。

source: The above command adds `MY_ENV_VAR=foobar` as an environment variable. The key `my-env-var` will convert to uppercase and dashes will be replaced by underscores resulting in `MY_ENV_VAR`.
ja_jp: 上記のコマンドは `MY_ENV_VAR=foobar` を環境変数として追加します。 キー `my-env-var` は大文字に変換され、ダッシュはアンダースコアに置き換えられ、 `MY_ENV_VAR` となります。

source: The above command should return `["first"]` indicating that we have only one increment thus far.
ja_jp: 上記のコマンドは `["first"]` を返し、これまでのところインクリメントが 1 つしかないことを示しているはずです。

source: The above command will generate a native binary and the CSV files mentioned above.
ja_jp: 上記のコマンドを実行すると、ネイティブ・バイナリと上記のCSVファイルが生成されます。

source: The above configuration is sufficient for registering new clients using this configuration. For example:
ja_jp: 上記の設定は、この設定を使用して新しいクライアントを登録するのに十分なものです。次に例を示します。

source: The above configuration is sufficient to require that OIDC bearer tokens are bound to the client certificates.
ja_jp: 上記の設定を使用すると、OIDC ベアラートークンをクライアント証明書にバインドすることが必須にできます。

source: The above configuration will lead to two new client registrations created in your OIDC provider.
ja_jp: 上記の設定により、OIDC プロバイダーに 2 つの新しいクライアント登録が作成されます。

source: The above creates a `Metadata` object we can add to the `Message` being produced, which retrieves the OpenTelemetry `Context` to extract the current span for propagation.
ja_jp: 上記は、生成されている `Message` に追加できる `Metadata` オブジェクトを作成し、OpenTelemetry `Context` を取得して、伝播のために現在のスパンを抽出しています。

source: The above creates a `TracingMetadata` object we can add to the `Message` being produced, which retrieves the OpenTelemetry `Context` to extract the current span for propagation.
ja_jp: 上記は、生成されている `Message` に追加できる `TracingMetadata` オブジェクトを作成し、 OpenTelemetry `Context` を取得して、伝播のために現在のスパンを抽出しています。

source: The above example shows a few different ways the API can be used.
ja_jp: 上記の例では、APIの使用方法のいくつか異なる方法を紹介しています。

source: The above example shows a few different ways the API can be used. The first method simply calls begin, does some work and commits it. This created transaction is tied to the CDI request scope, so if it is still active when the request scope is destroyed then it will be automatically rolled back. This removes the need to explicitly catch exceptions and call `rollback`, and acts as a safety net against inadvertent transaction leaks, however it does mean that this can only be used when the request scope is active. The second example in the method calls begin with a timeout option, and then rolls back the transaction.
ja_jp: 上記の例では、APIをいくつかの異なる方法で使用することができます。最初の方法は、単純に begin を呼び出し、何らかの処理を行い、それをコミットするものです。この作成されたトランザクションはCDIリクエストスコープに関連付けられ、リクエストスコープが破壊されたときにまだアクティブであれば、自動的にロールバックされます。これにより、明示的に例外をキャッチしたり `rollback` を呼び出したりする必要がなくなり、 不用意なトランザクションリークに対するセーフティネットとして機能します。 しかし、これはリクエストスコープがアクティブであるときにしか使えないということになります。メソッド呼び出しの2番目の例は、タイムアウトオプションで開始し、トランザクションをロールバックします。

source: The above example simulates sending a Cognito principal with an HTTP request to your HTTP Lambda.
ja_jp: 上記の例は、HTTP リクエストを含む Cognito プリンシパルを HTTP Lambda に送信することをシミュレートしています。

source: The above is available by default, however, adding the `{web-locator-ga}` extension allows you to reference the files without having to include the version in the path, example `/_static/lit/index.js`.
ja_jp: 上記はデフォルトで利用可能ですが、 `{web-locator-ga}` エクステンションを追加すると、パスにバージョンを含めなくてもファイルを参照できます (例: `/_static/lit/index.js`)。

source: The above is available by default, however, adding the `{web-locator-ga}` extension allows you to reference the files without having to include the version in the path, example `/webjars/jquery/jquery.min.js`.
ja_jp: 上記はデフォルトで利用可能ですが、 `{web-locator-ga}` エクステンションを追加すると、パスにバージョンを含めなくてもファイルを参照できます (例: `/webjars/jquery/jquery.min.js`)。

source: The above priorities have changed in Quarkus plugin starting with 3.0. Older versions of the Quarkus Gradle plugin preferred `application.properties` over settings in the Gradle build.
ja_jp: Quarkusプラグインでは、3.0から上記の優先順位が変更されました。古いバージョンのQuarkus Gradleプラグインでは、Gradleビルドの設定よりも `application.properties` が優先されました。

source: The above produced Marshaller method MUST return `MessageMarshaller` without types or else it will not be found.
ja_jp: 上記のように生成されたMarshallerメソッドは、型なしで `MessageMarshaller` を返さなければなりません。さもないと、それが見つかりません。

source: The above resource is exposing a new endpoint, `reactive-fruits`. Its capabilities are identical to the ones that we created before with `FruitResource`, but everything is handled in a reactive fashion, without any blocking operation.
ja_jp: 上記のリソースは、新しいエンドポイント `reactive-fruits` を公開しています。その機能は、以前に `FruitResource` で作成したものと同じですが、すべてがブロッキング操作なしでリアクティブな方法で処理されます。

source: The above sequence of commands does the following:
ja_jp: 上記の一連のコマンドは、次のような動作をします。

source: The above sequence of commands should update the https://github.com/vert-x3/vertx-redis-client/blob/master/src/main/java/io/vertx/redis/client/Command.java[`Command.java`] file, so it includes all the possible commands supported by a particular Redis version.
ja_jp: 上記の一連のコマンドは、link:https://github.com/vert-x3/vertx-redis-client/blob/master/src/main/java/io/vertx/redis/client/Command.java[`Command.java`]ファイルを更新し、特定のRedisバージョンでサポートされるすべてのコマンドが含まれるようになります。

source: The above source produces this link: https://docs.asciidoctor.org/asciidoc/latest/syntax-quick-reference/[AsciiDoc Syntax Quick Reference,window=_blank,opts=nofollow].
ja_jp: 上記のソースはこのリンクを生み出しました: link: https://docs.asciidoctor.org/asciidoc/latest/syntax-quick-reference/[AsciiDoc Syntax Quick Reference,window=_blank,opts=nofollow].

source: The above source produces this link: https://docs.asciidoctor.org/asciidoc/latest/syntax-quick-reference/[Asciidoc Syntax Quick Reference,window=_blank,opts=nofollow].
ja_jp: 上記のソースからこのようなリンクが生成されます: link: https://docs.asciidoctor.org/asciidoc/latest/syntax-quick-reference/[Asciidoc Syntax Quick Reference,window=_blank,opts=nofollow]

source: The above source produces this link:https://docs.asciidoctor.org/asciidoc/latest/syntax-quick-reference/[AsciiDoc Syntax Quick Reference,window=_blank,opts=nofollow].
ja_jp: 上記のソースはこの link:https://docs.asciidoctor.org/asciidoc/latest/syntax-quick-reference/[AsciiDoc構文クイックリファレンス] を作成します。

source: The above steps detailed using the Qpid JMS AMQP client, however the guide can also be used with the Artemis JMS client. Many of the individual steps are exactly as previously <<qpid-jms-amqp, detailed above for Qpid JMS>>. The individual component code is the same. The only differences are in the dependency for the initial project creation, and the configuration properties used. These changes are detailed below and should be substituted for the equivalent step during the sequence above.
ja_jp: 上記の手順はQpid JMS AMQPクライアントを使用して詳細に説明していますが、このガイドはArtemis JMSクライアントでも使用することができます。個々のステップの多くは、 link:#qpid-jms-amqp[Qpid JMSの上記の詳細] と全く同じです。個々のコンポーネントコードも同じです。唯一の違いは、最初のプロジェクト作成のための依存関係と、使用される設定プロパティーです。これらの変更点は以下に詳述されており、上記のシーケンス中の同等のステップで代用する必要があります。

source: The above steps detailed using the Qpid JMS AMQP client, however the guide can also be used with the Artemis JMS client. Many of the individual steps are exactly as previously <<qpid-jms-amqp,detailed above for Qpid JMS>>. The individual component code is the same. The only differences are in the dependency for the initial project creation, and the configuration properties used. These changes are detailed below and should be substituted for the equivalent step during the sequence above.
ja_jp: 上記の手順ではQpid JMS AMQPクライアントを使用した場合について説明しましたが、このガイドはArtemis JMSクライアントでも使用できます。個々のステップの多くは、 xref:qpid-jms-amqp[上記Qpid JMSの詳細] と全く同じです。 個々のコンポーネントコードも同じです。 唯一の違いは、初期プロジェクト作成の依存関係と、使用する設定プロパティです。 これらの変更点の詳細を以下に示しますので、上記のシーケンス中の同等のステップに置き換えてください。

source: The above steps detailed using the Qpid JMS AMQP client, however the guide can also be used with the Artemis JMS client. Many of the individual steps are exactly as previously xref:qpid-jms-amqp[detailed above for Qpid JMS]. The individual component code is the same. The only differences are in the dependency for the initial project creation, and the configuration properties used. These changes are detailed below and should be substituted for the equivalent step during the sequence above.
ja_jp: 上記の手順では、Qpid JMS AMQPクライアントを使用した場合について説明しましたが、このガイドはArtemis JMSクライアントでも使用することができます。個々の手順の多くは、 xref:qpid-jms-amqp[前述のQpid JMSの場合] と全く同じです。個々のコンポーネントのコードも同じです。唯一の違いは、最初のプロジェクト作成時の依存関係と、使用する設定プロパティです。これらの変更点は以下に詳述されており、上記の順序で同等のステップに置き換えてください。

source: The absolute `back-channel logout` URL is calculated by adding `quarkus.oidc.back-channel-logout.path` to the current endpoint URL, for example, `http://localhost:8080/back-channel-logout`. You will need to configure this URL in the admin console of your OIDC provider.
ja_jp: 絶対的な `back-channel logout` URL は、現在のエンドポイント URL に `quarkus.oidc.back-channel-logout.path` を追加することによって計算されます (例: `http://localhost:8080/back-channel-logout`)。 この URL は、OIDC プロバイダーの管理コンソールで設定する必要があります。

source: The access to the cache can be _direct_ or use https://redis.io/docs/manual/transactions/#optimistic-locking-using-check-and-set[optimistic locking]. By default, optimistic locking is disabled.
ja_jp: キャッシュへのアクセスは、 _直接アクセス_ することも、 link:https://redis.io/docs/manual/transactions/#optimistic-locking-using-check-and-set[楽観的ロック] を使用することも可能です。デフォルトでは、楽観的なロックは無効です。

source: The access token acquired during the authorization code flow, alongside the ID token, is not used directly by the endpoint but is used only to access downstream services on behalf of the currently authenticated user. More to come on the topic of "access tokens", later in this tutorial.
ja_jp: 認可コードフロー中に取得したアクセストークンは、ID トークンとともに直接エンドポイントにより使用されるのではなく、現在認証されているユーザーに代わってダウンストリームサービスにアクセスする場合にのみ使用されます。 アクセストークンについては、このチュートリアルの後半で詳しく説明します。

source: The access token must be in the JWT format and contain an issuer (`iss`) token claim.
ja_jp: アクセストークンが JWT 形式で、issuer (`iss`) トークン要求を含んでいる必要があります。

source: The access token returned during the authorization code grant flow must be the source of roles (`quarkus.oidc.roles.source=accesstoken`).
ja_jp: 認可コード付与フロー中に返されるアクセストークンは、ロールのソース (`quarkus.oidc.roles.source=accesstoken`) である必要があります。

source: The access tokens managed by these extensions can be used as HTTP Authorization Bearer tokens to access the remote services.
ja_jp: これらのエクステンションで管理されているアクセストークンをHTTP Authorization ベアラートークンとして使用して、リモートサービスにアクセスすることができます。

source: The active exporter is automatically wired by CDI, that's why the `quarkus.otel.traces.exporter`, `quarkus.otel.metrics.exporter` and `quarkus.otel.logs.exporter` properties default value is `cdi`. This is not because of the protocol being used in the data transfer but because of how the exporters are wired.
ja_jp: アクティブなエクスポーターは CDI によって自動的にワイヤリングされるため、`quarkus.otel.traces.exporter`、`quarkus.otel.metrics.exporter`、および `quarkus.otel.logs.exporter` プロパティーのデフォルト値は `cdi` です。これはデータ転送に使用されるプロトコルによるものではなく、エクスポーターのワイヤリング方法によるものです。

source: The active profile is `dev`
ja_jp: アクティブなプロファイルは `dev` です

source: The actual query happens at `ResultSet rs = preparedStatement.executeQuery();`, here is how it is implemented in the postgresql-jdbc driver 42.5.0:
ja_jp: 実際のクエリは `ResultSet rs = preparedStatement.executeQuery();` で実行されます。以下は、postgresql-jdbc ドライバ 42.5.0 で実装されている方法です:

source: The actual values are extracted from the service labels and environment variables. The host is set to the Docker host IP address, and the port is set to the mapped port on the host.
ja_jp: 実際の値はサービスラベルと環境変数から抽出されます。ホストは Docker ホストの IP アドレスに設定され、ポートはホスト上のマッピングされたポートに設定されます。

source: The additional path that should be appended to the base URI.
ja_jp: ベース URI に追加する必要がある追加パス。

source: The address value can be a property expression. In this case, the configured value is used instead: `@ConsumeEvent("${my.consumer.address}")`. Additionally, the property expression can specify a default value: `@ConsumeEvent("${my.consumer.address:defaultAddress}")`.
ja_jp: アドレス値はプロパティー式にすることができます。 この場合、設定された値 `@ConsumeEvent ("${my.consumer.address}")` が代わりに使用されます。 さらに、プロパティー式ではデフォルト値 `@ConsumeEvent ("${my.consumer.address:defaultAddress}")` を指定できます。

source: The admin API is only accessible if you register with the `admin` user name.
ja_jp: admin APIは、 `admin` のユーザー名で登録した場合のみアクセス可能です。
